src/exps/fio_benchmarks/paperexps/R-1G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=22925: Thu Sep 27 14:54:28 2018
  write: IOPS=1040, BW=4161KiB/s (4261kB/s)(732MiB/180025msec)
    clat (usec): min=83, max=2399.4k, avg=957.30, stdev=11439.43
     lat (usec): min=83, max=2399.4k, avg=957.79, stdev=11439.45
    clat percentiles (usec):
     |  1.00th=[    95],  5.00th=[   102], 10.00th=[   105], 20.00th=[   108],
     | 30.00th=[   109], 40.00th=[   110], 50.00th=[   112], 60.00th=[   113],
     | 70.00th=[   115], 80.00th=[   122], 90.00th=[   149], 95.00th=[   192],
     | 99.00th=[ 22676], 99.50th=[ 32637], 99.90th=[123208], 99.95th=[160433],
     | 99.99th=[261096]
   bw (  KiB/s): min=    5, max=11486, per=72.52%, avg=3016.76, stdev=3705.18, samples=352
   iops        : min=    1, max= 2871, avg=753.80, stdev=926.30, samples=352
  lat (usec)   : 100=3.67%, 250=92.49%, 500=1.46%, 750=0.80%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.05%, 20=0.03%, 50=1.02%
  lat (msec)   : 100=0.05%, 250=0.42%, 500=0.01%, 1000=0.01%, 2000=0.01%
  lat (msec)   : >=2000=0.01%
  cpu          : usr=0.48%, sys=1.50%, ctx=187274, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,187270,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=23185: Thu Sep 27 14:54:28 2018
  write: IOPS=134, BW=538KiB/s (551kB/s)(158MiB/300207msec)
    clat (usec): min=75, max=3254.2k, avg=7431.87, stdev=57809.96
     lat (usec): min=75, max=3254.2k, avg=7432.33, stdev=57810.00
    clat percentiles (usec):
     |  1.00th=[     90],  5.00th=[    103], 10.00th=[    108],
     | 20.00th=[    111], 30.00th=[    113], 40.00th=[    115],
     | 50.00th=[    117], 60.00th=[    118], 70.00th=[    121],
     | 80.00th=[    131], 90.00th=[    161], 95.00th=[  22676],
     | 99.00th=[ 154141], 99.50th=[ 185598], 99.90th=[ 274727],
     | 99.95th=[ 767558], 99.99th=[3170894]
   bw (  KiB/s): min=    8, max=11296, per=100.00%, avg=602.59, stdev=2230.01, samples=536
   iops        : min=    2, max= 2824, avg=150.65, stdev=557.50, samples=536
  lat (usec)   : 100=2.83%, 250=89.36%, 500=1.16%, 750=0.68%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.02%, 10=0.12%, 20=0.09%, 50=0.90%
  lat (msec)   : 100=0.32%, 250=4.37%, 500=0.05%, 1000=0.02%, 2000=0.01%
  lat (msec)   : >=2000=0.02%
  cpu          : usr=0.06%, sys=0.26%, ctx=40374, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,40370,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4161KiB/s (4261kB/s), 4161KiB/s-4161KiB/s (4261kB/s-4261kB/s), io=732MiB (767MB), run=180025-180025msec

Run status group 1 (all jobs):
  WRITE: bw=538KiB/s (551kB/s), 538KiB/s-538KiB/s (551kB/s-551kB/s), io=158MiB (165MB), run=300207-300207msec

Disk stats (read/write):
  sdc: ios=120/227639, merge=0/0, ticks=1959/475481, in_queue=477497, util=99.04%