src/exps/fio_benchmarks/paperexps/R-1T.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=17137: Thu Sep 27 19:56:15 2018
  write: IOPS=1017, BW=4070KiB/s (4168kB/s)(716MiB/180095msec)
    clat (usec): min=81, max=285154, avg=978.23, stdev=9798.68
     lat (usec): min=82, max=285154, avg=978.74, stdev=9798.71
    clat percentiles (usec):
     |  1.00th=[    93],  5.00th=[    98], 10.00th=[   102], 20.00th=[   105],
     | 30.00th=[   106], 40.00th=[   108], 50.00th=[   109], 60.00th=[   110],
     | 70.00th=[   112], 80.00th=[   115], 90.00th=[   143], 95.00th=[   153],
     | 99.00th=[ 23200], 99.50th=[ 25560], 99.90th=[164627], 99.95th=[181404],
     | 99.99th=[214959]
   bw (  KiB/s): min=   12, max= 8995, per=79.29%, avg=3227.05, stdev=4032.78, samples=359
   iops        : min=    3, max= 2248, avg=806.32, stdev=1008.22, samples=359
  lat (usec)   : 100=7.10%, 250=89.41%, 500=1.03%, 750=0.92%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.04%, 20=0.03%, 50=1.02%
  lat (msec)   : 100=0.02%, 250=0.41%, 500=0.01%
  cpu          : usr=0.45%, sys=1.70%, ctx=183274, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,183269,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=17533: Thu Sep 27 19:56:15 2018
  write: IOPS=8, BW=35.0KiB/s (36.8kB/s)(10.5MiB/300010msec)
    clat (usec): min=85, max=390655, avg=111186.14, stdev=60902.06
     lat (usec): min=85, max=390657, avg=111186.95, stdev=60902.18
    clat percentiles (usec):
     |  1.00th=[   105],  5.00th=[   112], 10.00th=[   115], 20.00th=[ 68682],
     | 30.00th=[105382], 40.00th=[111674], 50.00th=[120062], 60.00th=[132645],
     | 70.00th=[147850], 80.00th=[160433], 90.00th=[175113], 95.00th=[187696],
     | 99.00th=[208667], 99.50th=[212861], 99.90th=[258999], 99.95th=[263193],
     | 99.99th=[392168]
   bw (  KiB/s): min=    8, max=  248, per=100.00%, avg=35.97, stdev=34.08, samples=600
   iops        : min=    2, max=   62, avg= 8.98, stdev= 8.51, samples=600
  lat (usec)   : 100=0.82%, 250=15.57%, 500=1.07%, 750=0.04%, 1000=0.04%
  lat (msec)   : 2=0.30%, 4=0.37%, 10=0.67%, 20=0.19%, 50=0.44%
  lat (msec)   : 100=4.11%, 250=76.28%, 500=0.11%
  cpu          : usr=0.01%, sys=0.04%, ctx=2700, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,2698,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4070KiB/s (4168kB/s), 4070KiB/s-4070KiB/s (4168kB/s-4168kB/s), io=716MiB (751MB), run=180095-180095msec

Run status group 1 (all jobs):
  WRITE: bw=35.0KiB/s (36.8kB/s), 35.0KiB/s-35.0KiB/s (36.8kB/s-36.8kB/s), io=10.5MiB (11.1MB), run=300010-300010msec

Disk stats (read/write):
  sdc: ios=80/185966, merge=0/0, ticks=1624/476320, in_queue=477991, util=99.21%