src/exps/fio_benchmarks/paperexps/R-256G.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=30850: Thu Sep 27 16:23:28 2018
  write: IOPS=1028, BW=4114KiB/s (4213kB/s)(723MiB/180016msec)
    clat (usec): min=79, max=1036.1k, avg=968.34, stdev=9798.80
     lat (usec): min=79, max=1036.1k, avg=968.80, stdev=9798.83
    clat percentiles (usec):
     |  1.00th=[    94],  5.00th=[   101], 10.00th=[   103], 20.00th=[   105],
     | 30.00th=[   106], 40.00th=[   108], 50.00th=[   109], 60.00th=[   110],
     | 70.00th=[   112], 80.00th=[   115], 90.00th=[   143], 95.00th=[   157],
     | 99.00th=[ 23200], 99.50th=[ 32900], 99.90th=[154141], 99.95th=[164627],
     | 99.99th=[187696]
   bw (  KiB/s): min=    6, max=11145, per=79.30%, avg=3262.39, stdev=4004.60, samples=357
   iops        : min=    1, max= 2786, avg=815.23, stdev=1001.14, samples=357
  lat (usec)   : 100=4.52%, 250=91.95%, 500=1.04%, 750=0.91%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.07%, 20=0.03%, 50=1.01%
  lat (msec)   : 100=0.04%, 250=0.42%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=0.46%, sys=1.48%, ctx=185153, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,185148,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=31111: Thu Sep 27 16:23:28 2018
  write: IOPS=28, BW=114KiB/s (117kB/s)(33.5MiB/300047msec)
    clat (usec): min=92, max=200050, avg=35025.69, stdev=57721.47
     lat (usec): min=93, max=200051, avg=35026.27, stdev=57721.65
    clat percentiles (usec):
     |  1.00th=[   102],  5.00th=[   106], 10.00th=[   108], 20.00th=[   110],
     | 30.00th=[   111], 40.00th=[   113], 50.00th=[   115], 60.00th=[   128],
     | 70.00th=[   269], 80.00th=[105382], 90.00th=[135267], 95.00th=[156238],
     | 99.00th=[170918], 99.50th=[177210], 99.90th=[187696], 99.95th=[193987],
     | 99.99th=[200279]
   bw (  KiB/s): min=   24, max=  648, per=100.00%, avg=114.20, stdev=196.36, samples=600
   iops        : min=    6, max=  162, avg=28.55, stdev=49.09, samples=600
  lat (usec)   : 100=0.49%, 250=69.48%, 500=0.06%
  lat (msec)   : 2=0.36%, 4=0.51%, 10=0.88%, 20=0.32%, 50=0.19%
  lat (msec)   : 100=2.41%, 250=25.31%
  cpu          : usr=0.02%, sys=0.08%, ctx=8567, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,8565,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=4114KiB/s (4213kB/s), 4114KiB/s-4114KiB/s (4213kB/s-4213kB/s), io=723MiB (758MB), run=180016-180016msec

Run status group 1 (all jobs):
  WRITE: bw=114KiB/s (117kB/s), 114KiB/s-114KiB/s (117kB/s-117kB/s), io=33.5MiB (35.1MB), run=300047-300047msec

Disk stats (read/write):
  sdc: ios=111/193711, merge=0/0, ticks=368/476167, in_queue=476494, util=99.21%