src/exps/fio_benchmarks/paperexps/R-256M.log
job_warming: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
job_real: (g=1): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1
fio-3.1
Starting 2 processes

job_warming: (groupid=0, jobs=1): err= 0: pid=21511: Thu Sep 27 14:38:16 2018
  write: IOPS=2582, BW=10.1MiB/s (10.6MB/s)(1816MiB/180001msec)
    clat (usec): min=81, max=285989, avg=382.62, stdev=3042.47
     lat (usec): min=81, max=285989, avg=383.20, stdev=3042.48
    clat percentiles (usec):
     |  1.00th=[   99],  5.00th=[  104], 10.00th=[  106], 20.00th=[  111],
     | 30.00th=[  113], 40.00th=[  115], 50.00th=[  116], 60.00th=[  118],
     | 70.00th=[  120], 80.00th=[  123], 90.00th=[  151], 95.00th=[  161],
     | 99.00th=[18220], 99.50th=[22676], 99.90th=[32113], 99.95th=[32637],
     | 99.99th=[43779]
   bw (  KiB/s): min= 3097, max=10353, per=78.93%, avg=8154.69, stdev=1139.90, samples=359
   iops        : min=  774, max= 2588, avg=2038.28, stdev=284.95, samples=359
  lat (usec)   : 100=1.70%, 250=95.28%, 500=1.17%, 750=0.77%, 1000=0.01%
  lat (msec)   : 2=0.01%, 10=0.05%, 20=0.04%, 50=0.98%, 100=0.01%
  lat (msec)   : 250=0.01%, 500=0.01%
  cpu          : usr=1.20%, sys=4.41%, ctx=464945, majf=0, minf=29
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,464925,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
job_real: (groupid=1, jobs=1): err= 0: pid=21769: Thu Sep 27 14:38:16 2018
  write: IOPS=2582, BW=10.1MiB/s (10.6MB/s)(3027MiB/300015msec)
    clat (usec): min=70, max=345660, avg=382.60, stdev=3053.88
     lat (usec): min=70, max=345660, avg=383.24, stdev=3053.90
    clat percentiles (usec):
     |  1.00th=[   99],  5.00th=[  104], 10.00th=[  109], 20.00th=[  112],
     | 30.00th=[  114], 40.00th=[  115], 50.00th=[  117], 60.00th=[  118],
     | 70.00th=[  120], 80.00th=[  123], 90.00th=[  151], 95.00th=[  161],
     | 99.00th=[17433], 99.50th=[22414], 99.90th=[32113], 99.95th=[32637],
     | 99.99th=[38536]
   bw (  KiB/s): min= 2600, max=13208, per=100.00%, avg=10332.96, stdev=1477.51, samples=600
   iops        : min=  650, max= 3302, avg=2583.23, stdev=369.37, samples=600
  lat (usec)   : 100=1.49%, 250=95.47%, 500=1.19%, 750=0.76%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.06%, 20=0.04%, 50=0.98%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=1.29%, sys=4.25%, ctx=774948, majf=0, minf=28
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=0,774919,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=10.1MiB/s (10.6MB/s), 10.1MiB/s-10.1MiB/s (10.6MB/s-10.6MB/s), io=1816MiB (1904MB), run=180001-180001msec

Run status group 1 (all jobs):
  WRITE: bw=10.1MiB/s (10.6MB/s), 10.1MiB/s-10.1MiB/s (10.6MB/s-10.6MB/s), io=3027MiB (3174MB), run=300015-300015msec

Disk stats (read/write):
  sdc: ios=74/1239462, merge=0/0, ticks=1884/450715, in_queue=451823, util=93.80%